let games = [
  {
    title: '1-0', //题目图片地址
    list: ['1-1', '1-2', '1-5', '1-4', '1-6', '1-3'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '1-0', //题目图片地址
    list: ['1-1', '1-2', '1-5', '1-4', '1-6', '1-3'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '2-0', //题目图片地址
    list: ['2-1', '2-2', '2-3', '2-4', '2-5', '2-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '3-0', //题目图片地址
    list: ['3-1', '3-2', '3-3', '3-4', '3-5', '3-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '4-0', //题目图片地址
    list: ['4-1', '4-2', '4-3', '4-4', '4-5', '4-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '5-0', //题目图片地址
    list: ['5-1', '5-2', '5-3', '5-4', '5-5', '5-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '6-0', //题目图片地址
    list: ['6-1', '6-2', '6-3', '6-4', '6-5', '6-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '7-0', //题目图片地址
    list: ['7-1', '7-2', '7-3', '7-4', '7-5', '7-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '8-0', //题目图片地址
    list: ['8-1', '8-2', '8-3', '8-4', '8-5', '8-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '9-0', //题目图片地址
    list: ['9-1', '9-2', '9-3', '9-4', '9-5', '9-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '10-0', //题目图片地址
    list: ['10-1', '10-2', '10-3', '10-4', '10-5', '10-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '11-0', //题目图片地址
    list: ['11-1', '11-2', '11-3', '11-4', '11-5', '11-6'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '12-0', //题目图片地址
    list: ['12-1', '12-2', '12-3', '12-4', '12-5', '12-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '13-0', //题目图片地址
    list: ['13-1', '13-2', '13-3', '13-4', '13-5', '13-6'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '14-0', //题目图片地址
    list: ['14-1', '14-2', '14-3', '14-4', '14-5', '14-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '15-0', //题目图片地址
    list: ['15-1', '15-2', '15-3', '15-4', '15-5', '15-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '16-0', //题目图片地址
    list: ['16-1', '16-2', '16-3', '16-4', '16-5', '16-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '17-0', //题目图片地址
    list: ['17-1', '17-2', '17-3', '17-4', '17-5', '17-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '18-0', //题目图片地址
    list: ['18-1', '18-2', '18-3', '18-4', '18-5', '18-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '19-0', //题目图片地址
    list: ['19-1', '19-2', '19-3', '19-4', '19-5', '19-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '20-0', //题目图片地址
    list: ['20-1', '20-2', '20-3', '20-4', '20-5', '20-6'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '21-0', //题目图片地址
    list: ['21-1', '21-2', '21-3', '21-4', '21-5', '21-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },

  {
    title: '22-0', //题目图片地址
    list: ['22-1', '22-2', '22-3', '22-4', '22-5', '22-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '23-0', //题目图片地址
    list: ['23-1', '23-2', '23-3', '23-4', '23-5', '23-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '24-0', //题目图片地址
    list: ['24-1', '24-2', '24-3', '24-4', '24-5', '24-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '25-0', //题目图片地址
    list: ['25-1', '25-2', '25-3', '25-4', '25-5', '25-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '26-0', //题目图片地址
    list: ['26-1', '26-2', '26-3', '26-4', '26-5', '26-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '27-0', //题目图片地址
    list: ['27-1', '27-2', '27-3', '27-4', '27-5', '27-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '28-0', //题目图片地址
    list: ['28-1', '28-2', '28-3', '28-4', '28-5', '28-6'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '29-0', //题目图片地址
    list: ['29-1', '29-2', '29-3', '29-4', '29-5', '29-6'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '30-0', //题目图片地址
    list: ['30-1', '30-2', '30-3', '30-4', '30-5', '30-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '31-0', //题目图片地址
    list: ['31-1', '31-2', '31-3', '31-4', '31-5', '31-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '32-0', //题目图片地址
    list: ['32-1', '32-2', '32-3', '32-4', '32-5', '32-6'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '33-0', //题目图片地址
    list: ['33-1', '33-2', '33-3', '33-4', '33-5', '33-6'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '34-0', //题目图片地址
    list: ['34-1', '34-2', '34-3', '34-4', '34-5', '34-6'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '35-0', //题目图片地址
    list: ['35-1', '35-2', '35-3', '35-4', '35-5', '35-6'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '36-0', //题目图片地址
    list: ['36-1', '36-2', '36-3', '36-4', '36-5', '36-6'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '37-0', //题目图片地址
    list: ['37-1', '37-2', '37-3', '37-4', '37-5', '37-6', '37-7', '37-8'], //从左往右图片地址
    choose: -1,
    active: 7, //正确答案
  },
  {
    title: '38-0', //题目图片地址
    list: ['38-1', '38-2', '38-3', '38-4', '38-5', '38-6', '38-7', '38-8'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '39-0', //题目图片地址
    list: ['39-1', '39-2', '39-3', '39-4', '39-5', '39-6', '39-7', '39-8'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '40-0', //题目图片地址
    list: ['40-1', '40-2', '40-3', '40-4', '40-5', '40-6', '40-7', '40-8'], //从左往右图片地址
    choose: -1,
    active: 7, //正确答案
  },
  {
    title: '41-0', //题目图片地址
    list: ['41-1', '41-2', '41-3', '41-4', '41-5', '41-6', '41-7', '41-8'], //从左往右图片地址
    choose: -1,
    active: 6, //正确答案
  },
  {
    title: '42-0', //题目图片地址
    list: ['42-1', '42-2', '42-3', '42-4', '42-5', '42-6', '42-7', '42-8'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '43-0', //题目图片地址
    list: ['43-1', '43-2', '43-3', '43-4', '43-5', '43-6', '43-7', '43-8'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '44-0', //题目图片地址
    list: ['44-1', '44-2', '44-3', '44-4', '44-5', '44-6', '44-7', '44-8'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '45-0', //题目图片地址
    list: ['45-1', '45-2', '45-3', '45-4', '45-5', '45-6', '45-7', '45-8'], //从左往右图片地址
    choose: -1,
    active: 6, //正确答案
  },
  {
    title: '46-0', //题目图片地址
    list: ['46-1', '46-2', '46-3', '46-4', '46-5', '46-6', '46-7', '46-8'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '47-0', //题目图片地址
    list: ['47-1', '47-2', '47-3', '47-4', '47-5', '47-6', '47-7', '47-8'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '48-0', //题目图片地址
    list: ['48-1', '48-2', '48-3', '48-4', '48-5', '48-6', '48-7', '48-8'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '49-0', //题目图片地址
    list: ['49-1', '49-2', '49-3', '49-4', '49-5', '49-6', '49-7', '49-8'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '50-0', //题目图片地址
    list: ['50-1', '50-2', '50-3', '50-4', '50-5', '50-6', '50-7', '50-8'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '51-0', //题目图片地址
    list: ['51-1', '51-2', '51-3', '51-4', '51-5', '51-6', '51-7', '51-8'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '52-0', //题目图片地址
    list: ['52-1', '52-2', '52-3', '52-4', '52-5', '52-6', '52-7', '52-8'], //从左往右图片地址
    choose: -1,
    active: 6, //正确答案
  },
  {
    title: '53-0', //题目图片地址
    list: ['53-1', '53-2', '53-3', '53-4', '53-5', '53-6', '53-7', '53-8'], //从左往右图片地址
    choose: -1,
    active: 7, //正确答案
  },
  {
    title: '54-0', //题目图片地址
    list: ['54-1', '54-2', '54-3', '54-4', '54-5', '54-6', '54-7', '54-8'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '55-0', //题目图片地址
    list: ['55-1', '55-2', '55-3', '55-4', '55-5', '55-6', '55-7', '55-8'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '56-0', //题目图片地址
    list: ['56-1', '56-2', '56-3', '56-4', '56-5', '56-6', '56-7', '56-8'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '57-0', //题目图片地址
    list: ['57-1', '57-2', '57-3', '57-4', '57-5', '57-6', '57-7', '57-8'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '58-0', //题目图片地址
    list: ['58-1', '58-2', '58-3', '58-4', '58-5', '58-6', '58-7', '58-8'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '59-0', //题目图片地址
    list: ['59-1', '59-2', '59-3', '59-4', '59-5', '59-6', '59-7', '59-8'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '60-0', //题目图片地址
    list: ['60-1', '60-2', '60-3', '60-4', '60-5', '60-6', '60-7', '60-8'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '61-0', //题目图片地址
    list: ['61-1', '61-2', '61-3', '61-4', '61-5', '61-6', '61-7', '61-8'], //从左往右图片地址
    choose: -1,
    active: 6, //正确答案
  },
  {
    title: '62-0', //题目图片地址
    list: ['62-1', '62-2', '62-3', '62-4', '62-5', '62-6', '62-7', '62-8'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '63-0', //题目图片地址
    list: ['63-1', '63-2', '63-3', '63-4', '63-5', '63-6', '63-7', '63-8'], //从左往右图片地址
    choose: -1,
    active: 7, //正确答案
  },
  {
    title: '64-0', //题目图片地址
    list: ['64-1', '64-2', '64-3', '64-4', '64-5', '64-6', '64-7', '64-8'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '65-8', //题目图片地址
    list: ['65-0', '65-1', '65-2', '65-3', '65-4', '65-5', '65-6', '65-7'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '66-0', //题目图片地址
    list: ['66-1', '66-2', '66-3', '66-4', '66-5', '66-6', '66-7', '66-8'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
  {
    title: '67-0', //题目图片地址
    list: ['67-1', '67-2', '67-3', '67-4', '67-5', '67-6', '67-7', '67-8'], //从左往右图片地址
    choose: -1,
    active: 0, //正确答案
  },
  {
    title: '68-0', //题目图片地址
    list: ['68-1', '68-2', '68-3', '68-4', '68-5', '68-6', '68-7', '68-8'], //从左往右图片地址
    choose: -1,
    active: 5, //正确答案
  },
  {
    title: '69-0', //题目图片地址
    list: ['69-1', '69-2', '69-3', '69-4', '69-5', '69-6', '69-7', '69-8'], //从左往右图片地址
    choose: -1,
    active: 2, //正确答案
  },
  {
    title: '70-0', //题目图片地址
    list: ['70-1', '70-2', '70-3', '70-4', '70-5', '70-6', '70-7', '70-8'], //从左往右图片地址
    choose: -1,
    active: 1, //正确答案
  },
  {
    title: '71-0', //题目图片地址
    list: ['71-1', '71-2', '71-3', '71-4', '71-5', '71-6', '71-7', '71-8'], //从左往右图片地址
    choose: -1,
    active: 3, //正确答案
  },
  {
    title: '72-0', //题目图片地址
    list: ['72-1', '72-2', '72-3', '72-4', '72-5', '72-6', '72-7', '72-8'], //从左往右图片地址
    choose: -1,
    active: 4, //正确答案
  },
];

function shuffle(a) {
  var len = a.length;
  for (var i = 0; i < len; i++) {
    var end = len - 1;
    var index = (Math.random() * (end + 1)) >> 0;
    var t = a[end];
    a[end] = a[index];
    a[index] = t;
  }
  return a;
}

export { games, shuffle };
